
public class Task_1 {
    /*
        Объявите переменные типа int, byte, short, long, float, double. Название переменных может быть любым.
        Выведите в консоль значение каждой переменной в формате “Значение переменной … с типом … равно …”
    */
    private static int i = 1;
    private static byte b = 2;
    private static short s = 3;
    private static long l = 4;
    private static float f = 5;
    private static double d = 6;

    public static void solution() {
        System.out.println("Значение переменной i с типом int равно " + i);
        System.out.println("Значение переменной b с типом byte равно " + b);
        System.out.println("Значение переменной s с типом short равно " + s);
        System.out.println("Значение переменной l с типом long равно " + l);
        System.out.println("Значение переменной f с типом float равно " + f);
        System.out.println("Значение переменной d с типом double равно " + d);
    }
}
